###################################################################

# Created by write_sdc on Wed Dec 10 11:28:19 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_max_area 0
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports rst_n]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports init_mem_en]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_addr[7]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_addr[6]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_addr[5]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_addr[4]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_addr[3]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_addr[2]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_addr[1]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_addr[0]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_dval[7]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_dval[6]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_dval[5]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_dval[4]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_dval[3]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_dval[2]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_dval[1]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_dval[0]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_ival[7]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_ival[6]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_ival[5]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_ival[4]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_ival[3]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_ival[2]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_ival[1]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {init_mem_ival[0]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {TileID[3]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {TileID[2]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {TileID[1]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {TileID[0]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_e[12]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_e[11]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_e[10]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_e[9]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_e[8]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_e[7]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_e[6]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_e[5]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_e[4]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_e[3]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_e[2]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_e[1]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_e[0]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_s[12]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_s[11]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_s[10]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_s[9]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_s[8]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_s[7]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_s[6]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_s[5]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_s[4]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_s[3]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_s[2]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_s[1]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_s[0]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_w[12]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_w[11]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_w[10]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_w[9]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_w[8]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_w[7]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_w[6]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_w[5]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_w[4]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_w[3]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_w[2]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_w[1]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_w[0]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_n[12]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_n[11]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_n[10]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_n[9]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_n[8]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_n[7]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_n[6]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_n[5]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_n[4]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_n[3]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_n[2]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_n[1]}]
set_driving_cell -lib_cell DFFRX1 -pin Q [get_ports {indata_n[0]}]
set_load -pin_load 0.000207334 [get_ports {outdata_e[12]}]
set_load -pin_load 0.000207334 [get_ports {outdata_e[11]}]
set_load -pin_load 0.000207334 [get_ports {outdata_e[10]}]
set_load -pin_load 0.000207334 [get_ports {outdata_e[9]}]
set_load -pin_load 0.000207334 [get_ports {outdata_e[8]}]
set_load -pin_load 0.000207334 [get_ports {outdata_e[7]}]
set_load -pin_load 0.000207334 [get_ports {outdata_e[6]}]
set_load -pin_load 0.000207334 [get_ports {outdata_e[5]}]
set_load -pin_load 0.000207334 [get_ports {outdata_e[4]}]
set_load -pin_load 0.000207334 [get_ports {outdata_e[3]}]
set_load -pin_load 0.000207334 [get_ports {outdata_e[2]}]
set_load -pin_load 0.000207334 [get_ports {outdata_e[1]}]
set_load -pin_load 0.000207334 [get_ports {outdata_e[0]}]
set_load -pin_load 0.000207334 [get_ports {outdata_s[12]}]
set_load -pin_load 0.000207334 [get_ports {outdata_s[11]}]
set_load -pin_load 0.000207334 [get_ports {outdata_s[10]}]
set_load -pin_load 0.000207334 [get_ports {outdata_s[9]}]
set_load -pin_load 0.000207334 [get_ports {outdata_s[8]}]
set_load -pin_load 0.000207334 [get_ports {outdata_s[7]}]
set_load -pin_load 0.000207334 [get_ports {outdata_s[6]}]
set_load -pin_load 0.000207334 [get_ports {outdata_s[5]}]
set_load -pin_load 0.000207334 [get_ports {outdata_s[4]}]
set_load -pin_load 0.000207334 [get_ports {outdata_s[3]}]
set_load -pin_load 0.000207334 [get_ports {outdata_s[2]}]
set_load -pin_load 0.000207334 [get_ports {outdata_s[1]}]
set_load -pin_load 0.000207334 [get_ports {outdata_s[0]}]
set_load -pin_load 0.000207334 [get_ports {outdata_w[12]}]
set_load -pin_load 0.000207334 [get_ports {outdata_w[11]}]
set_load -pin_load 0.000207334 [get_ports {outdata_w[10]}]
set_load -pin_load 0.000207334 [get_ports {outdata_w[9]}]
set_load -pin_load 0.000207334 [get_ports {outdata_w[8]}]
set_load -pin_load 0.000207334 [get_ports {outdata_w[7]}]
set_load -pin_load 0.000207334 [get_ports {outdata_w[6]}]
set_load -pin_load 0.000207334 [get_ports {outdata_w[5]}]
set_load -pin_load 0.000207334 [get_ports {outdata_w[4]}]
set_load -pin_load 0.000207334 [get_ports {outdata_w[3]}]
set_load -pin_load 0.000207334 [get_ports {outdata_w[2]}]
set_load -pin_load 0.000207334 [get_ports {outdata_w[1]}]
set_load -pin_load 0.000207334 [get_ports {outdata_w[0]}]
set_load -pin_load 0.000207334 [get_ports {outdata_n[12]}]
set_load -pin_load 0.000207334 [get_ports {outdata_n[11]}]
set_load -pin_load 0.000207334 [get_ports {outdata_n[10]}]
set_load -pin_load 0.000207334 [get_ports {outdata_n[9]}]
set_load -pin_load 0.000207334 [get_ports {outdata_n[8]}]
set_load -pin_load 0.000207334 [get_ports {outdata_n[7]}]
set_load -pin_load 0.000207334 [get_ports {outdata_n[6]}]
set_load -pin_load 0.000207334 [get_ports {outdata_n[5]}]
set_load -pin_load 0.000207334 [get_ports {outdata_n[4]}]
set_load -pin_load 0.000207334 [get_ports {outdata_n[3]}]
set_load -pin_load 0.000207334 [get_ports {outdata_n[2]}]
set_load -pin_load 0.000207334 [get_ports {outdata_n[1]}]
set_load -pin_load 0.000207334 [get_ports {outdata_n[0]}]
set_load -pin_load 0.000207334 [get_ports {cpu2router[12]}]
set_load -pin_load 0.000207334 [get_ports {cpu2router[11]}]
set_load -pin_load 0.000207334 [get_ports {cpu2router[10]}]
set_load -pin_load 0.000207334 [get_ports {cpu2router[9]}]
set_load -pin_load 0.000207334 [get_ports {cpu2router[8]}]
set_load -pin_load 0.000207334 [get_ports {cpu2router[7]}]
set_load -pin_load 0.000207334 [get_ports {cpu2router[6]}]
set_load -pin_load 0.000207334 [get_ports {cpu2router[5]}]
set_load -pin_load 0.000207334 [get_ports {cpu2router[4]}]
set_load -pin_load 0.000207334 [get_ports {cpu2router[3]}]
set_load -pin_load 0.000207334 [get_ports {cpu2router[2]}]
set_load -pin_load 0.000207334 [get_ports {cpu2router[1]}]
set_load -pin_load 0.000207334 [get_ports {cpu2router[0]}]
set_load -pin_load 0.000207334 [get_ports {router2cpu[12]}]
set_load -pin_load 0.000207334 [get_ports {router2cpu[11]}]
set_load -pin_load 0.000207334 [get_ports {router2cpu[10]}]
set_load -pin_load 0.000207334 [get_ports {router2cpu[9]}]
set_load -pin_load 0.000207334 [get_ports {router2cpu[8]}]
set_load -pin_load 0.000207334 [get_ports {router2cpu[7]}]
set_load -pin_load 0.000207334 [get_ports {router2cpu[6]}]
set_load -pin_load 0.000207334 [get_ports {router2cpu[5]}]
set_load -pin_load 0.000207334 [get_ports {router2cpu[4]}]
set_load -pin_load 0.000207334 [get_ports {router2cpu[3]}]
set_load -pin_load 0.000207334 [get_ports {router2cpu[2]}]
set_load -pin_load 0.000207334 [get_ports {router2cpu[1]}]
set_load -pin_load 0.000207334 [get_ports {router2cpu[0]}]
create_clock [get_ports clk]  -period 8.9762  -waveform {0 4.4881}
set_clock_uncertainty 0.05  [get_clocks clk]
set_input_delay -clock clk  0.1  [get_ports rst_n]
set_input_delay -clock clk  0.1  [get_ports init_mem_en]
set_input_delay -clock clk  0.1  [get_ports {init_mem_addr[7]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_addr[6]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_addr[5]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_addr[4]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_addr[3]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_addr[2]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_addr[1]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_addr[0]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_dval[7]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_dval[6]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_dval[5]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_dval[4]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_dval[3]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_dval[2]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_dval[1]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_dval[0]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_ival[7]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_ival[6]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_ival[5]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_ival[4]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_ival[3]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_ival[2]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_ival[1]}]
set_input_delay -clock clk  0.1  [get_ports {init_mem_ival[0]}]
set_input_delay -clock clk  0.1  [get_ports {TileID[3]}]
set_input_delay -clock clk  0.1  [get_ports {TileID[2]}]
set_input_delay -clock clk  0.1  [get_ports {TileID[1]}]
set_input_delay -clock clk  0.1  [get_ports {TileID[0]}]
set_input_delay -clock clk  0.1  [get_ports {indata_e[12]}]
set_input_delay -clock clk  0.1  [get_ports {indata_e[11]}]
set_input_delay -clock clk  0.1  [get_ports {indata_e[10]}]
set_input_delay -clock clk  0.1  [get_ports {indata_e[9]}]
set_input_delay -clock clk  0.1  [get_ports {indata_e[8]}]
set_input_delay -clock clk  0.1  [get_ports {indata_e[7]}]
set_input_delay -clock clk  0.1  [get_ports {indata_e[6]}]
set_input_delay -clock clk  0.1  [get_ports {indata_e[5]}]
set_input_delay -clock clk  0.1  [get_ports {indata_e[4]}]
set_input_delay -clock clk  0.1  [get_ports {indata_e[3]}]
set_input_delay -clock clk  0.1  [get_ports {indata_e[2]}]
set_input_delay -clock clk  0.1  [get_ports {indata_e[1]}]
set_input_delay -clock clk  0.1  [get_ports {indata_e[0]}]
set_input_delay -clock clk  0.1  [get_ports {indata_s[12]}]
set_input_delay -clock clk  0.1  [get_ports {indata_s[11]}]
set_input_delay -clock clk  0.1  [get_ports {indata_s[10]}]
set_input_delay -clock clk  0.1  [get_ports {indata_s[9]}]
set_input_delay -clock clk  0.1  [get_ports {indata_s[8]}]
set_input_delay -clock clk  0.1  [get_ports {indata_s[7]}]
set_input_delay -clock clk  0.1  [get_ports {indata_s[6]}]
set_input_delay -clock clk  0.1  [get_ports {indata_s[5]}]
set_input_delay -clock clk  0.1  [get_ports {indata_s[4]}]
set_input_delay -clock clk  0.1  [get_ports {indata_s[3]}]
set_input_delay -clock clk  0.1  [get_ports {indata_s[2]}]
set_input_delay -clock clk  0.1  [get_ports {indata_s[1]}]
set_input_delay -clock clk  0.1  [get_ports {indata_s[0]}]
set_input_delay -clock clk  0.1  [get_ports {indata_w[12]}]
set_input_delay -clock clk  0.1  [get_ports {indata_w[11]}]
set_input_delay -clock clk  0.1  [get_ports {indata_w[10]}]
set_input_delay -clock clk  0.1  [get_ports {indata_w[9]}]
set_input_delay -clock clk  0.1  [get_ports {indata_w[8]}]
set_input_delay -clock clk  0.1  [get_ports {indata_w[7]}]
set_input_delay -clock clk  0.1  [get_ports {indata_w[6]}]
set_input_delay -clock clk  0.1  [get_ports {indata_w[5]}]
set_input_delay -clock clk  0.1  [get_ports {indata_w[4]}]
set_input_delay -clock clk  0.1  [get_ports {indata_w[3]}]
set_input_delay -clock clk  0.1  [get_ports {indata_w[2]}]
set_input_delay -clock clk  0.1  [get_ports {indata_w[1]}]
set_input_delay -clock clk  0.1  [get_ports {indata_w[0]}]
set_input_delay -clock clk  0.1  [get_ports {indata_n[12]}]
set_input_delay -clock clk  0.1  [get_ports {indata_n[11]}]
set_input_delay -clock clk  0.1  [get_ports {indata_n[10]}]
set_input_delay -clock clk  0.1  [get_ports {indata_n[9]}]
set_input_delay -clock clk  0.1  [get_ports {indata_n[8]}]
set_input_delay -clock clk  0.1  [get_ports {indata_n[7]}]
set_input_delay -clock clk  0.1  [get_ports {indata_n[6]}]
set_input_delay -clock clk  0.1  [get_ports {indata_n[5]}]
set_input_delay -clock clk  0.1  [get_ports {indata_n[4]}]
set_input_delay -clock clk  0.1  [get_ports {indata_n[3]}]
set_input_delay -clock clk  0.1  [get_ports {indata_n[2]}]
set_input_delay -clock clk  0.1  [get_ports {indata_n[1]}]
set_input_delay -clock clk  0.1  [get_ports {indata_n[0]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_e[12]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_e[11]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_e[10]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_e[9]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_e[8]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_e[7]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_e[6]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_e[5]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_e[4]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_e[3]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_e[2]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_e[1]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_e[0]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_s[12]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_s[11]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_s[10]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_s[9]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_s[8]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_s[7]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_s[6]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_s[5]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_s[4]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_s[3]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_s[2]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_s[1]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_s[0]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_w[12]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_w[11]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_w[10]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_w[9]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_w[8]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_w[7]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_w[6]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_w[5]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_w[4]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_w[3]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_w[2]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_w[1]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_w[0]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_n[12]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_n[11]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_n[10]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_n[9]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_n[8]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_n[7]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_n[6]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_n[5]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_n[4]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_n[3]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_n[2]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_n[1]}]
set_output_delay -clock clk  0.4  [get_ports {outdata_n[0]}]
set_output_delay -clock clk  0.4  [get_ports {cpu2router[12]}]
set_output_delay -clock clk  0.4  [get_ports {cpu2router[11]}]
set_output_delay -clock clk  0.4  [get_ports {cpu2router[10]}]
set_output_delay -clock clk  0.4  [get_ports {cpu2router[9]}]
set_output_delay -clock clk  0.4  [get_ports {cpu2router[8]}]
set_output_delay -clock clk  0.4  [get_ports {cpu2router[7]}]
set_output_delay -clock clk  0.4  [get_ports {cpu2router[6]}]
set_output_delay -clock clk  0.4  [get_ports {cpu2router[5]}]
set_output_delay -clock clk  0.4  [get_ports {cpu2router[4]}]
set_output_delay -clock clk  0.4  [get_ports {cpu2router[3]}]
set_output_delay -clock clk  0.4  [get_ports {cpu2router[2]}]
set_output_delay -clock clk  0.4  [get_ports {cpu2router[1]}]
set_output_delay -clock clk  0.4  [get_ports {cpu2router[0]}]
set_output_delay -clock clk  0.4  [get_ports {router2cpu[12]}]
set_output_delay -clock clk  0.4  [get_ports {router2cpu[11]}]
set_output_delay -clock clk  0.4  [get_ports {router2cpu[10]}]
set_output_delay -clock clk  0.4  [get_ports {router2cpu[9]}]
set_output_delay -clock clk  0.4  [get_ports {router2cpu[8]}]
set_output_delay -clock clk  0.4  [get_ports {router2cpu[7]}]
set_output_delay -clock clk  0.4  [get_ports {router2cpu[6]}]
set_output_delay -clock clk  0.4  [get_ports {router2cpu[5]}]
set_output_delay -clock clk  0.4  [get_ports {router2cpu[4]}]
set_output_delay -clock clk  0.4  [get_ports {router2cpu[3]}]
set_output_delay -clock clk  0.4  [get_ports {router2cpu[2]}]
set_output_delay -clock clk  0.4  [get_ports {router2cpu[1]}]
set_output_delay -clock clk  0.4  [get_ports {router2cpu[0]}]
